In [18]:
import pandas as pd 
import requests as re
from bs4 import BeautifulSoup as soup

1. Drop the team name column from the file 
2. Use the ootp browser ui thing or from fangraphs or baseball reference get each teams active roster 
3. Figure out the best way to make a new columns in the dataframe so we can add in division and league columns
4. Create a function that goes through each player in the dataframe and checks to see which roster they are on 
5. based on which roster they are on, assign an abbrieviated league and division tag to the columns and row associated with the current player 
6. continue with the rest of the project

In [90]:
# Create a pandas dataframe called 'data' using the read csv function to convert the csv into a df

data = pd.read_csv('player_list.csv')

In [91]:
# Return the column names

data.columns

Index(['ID', 'POS', 'Name', 'TM', 'Age', 'NAT', 'B', 'T'], dtype='object')

In [92]:
# print out 5 rows of the dataframt to check that everything looks good

data.head(5)

      ID POS             Name         TM   Age  NAT      B      T
0  32906  SP  Sandy Alcantara      Miami  25.0  DOM  Right  Right
1  32688  SP  Tyler Alexander    Detroit  26.0  USA  Right   Left
2  33887  SP   Adbert Alzolay    Chicago  26.0  VEN  Right  Right
3  21368  SP   Brett Anderson  Milwaukee  33.0  USA   Left   Left
4  25637  SP     Ian Anderson    Atlanta  22.0  USA  Right  Right

In [ ]:


for data.team in data:
    if data.team == 'Yan'